[
    {
        "Id": "1",
        "Name": "Saju Jirugi",
        "KoreanName": "사주 찌르기",
        "Image": "/images/forms/saju-jirugi",
        "Meaning": "Four-Direction Punch",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Right leg steps forward into a Right Front Stance: Right Middle Punch, Kihap!</strong></li><li>Right leg shifts into a Left Front Stance facing C: Left Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg shifts into a Left Front Stance facing D: Left Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg shifts into a Left Front Stance facing E: Left Down Block</li><li><strong> Right leg steps forward into a Right Front Stance: Right Middle Punch, Kihap!</strong></li><li>Right leg returns to Parallel Ready Stance facing B.</li><li><strong>Left leg steps forward into a Left Front Stance: Left Middle Punch, Kihap!</strong></li><li>Left leg shifts into a Right Front Stance facing E: Right Down Block</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li>Left leg shifts into a Right Front Stance facing D: Right Down Block</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li>Left shifts into a Right Front Stance facing C: Right Down Block</li><li><strong>Left leg steps forward into a Left Front Stance: Left Middle Punch, Kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "2",
        "Name": "Saju Makgi",
        "KoreanName": "사주 막기",
        "Image": "/images/forms/saju-makgi",
        "Meaning": "Four-Direction Block",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Right leg steps back into a Left Front Stance: Left Open-Hand Down Block, Kihap!</strong></li><li>Right leg steps forward into a Right Front Stance: Right Inside Forearm Block</li><li>Right leg shifts into Left Front Stance facing D: Left Open-Hand Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Inside Forearm Block</li><li>Right leg shifts into a Left Front Stance towards B: Left Open-Hand Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Inside Forearm Block</li><li>Right leg shifts into a Left Front Stance towards E: Left Open-Hand Down Block</li><li><strong>Right leg steps forward into a Right Front Stance: Right Inside Forearm Block, Kihap!</strong></li><li>Right leg returns to Parallel Ready Stance Facing C</li><li><strong>Left leg steps back into a Right Front Stance: Right Open-Hand Down Block, Kihap!</strong></li><li>Right leg steps forward into a Left Front Stance: Left Inside Forearm Block</li><li>Left leg shifts into a Right Front Stance Towards E: Right Open-Hand Down Block</li><li>Right leg steps forward into a Left Front Stance: Left Inside Forearm Block</li><li>Left leg shifts into a Right Front Stance towards B: Right Open-Hand Down Block</li><li>Right leg steps forward into a Left Front Stance: Left Inside Forearm Block</li><li>Left leg shifts into a Right Front Stance towards D: Right Open-Hand Down Block</li><li><strong>Right leg steps forward into a Left Front Stance: Left Inside Forearm Block, Kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "3",
        "Name": "Chon-Ji",
        "KoreanName": "천지",
        "Image": "/images/forms/chon-ji",
        "Meaning": "Heaven and earth",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Left leg turns into a Left Front Stance facing B: Left Down Block, kihap!</strong></li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg turns into a Right Front Stance facing C: Right Down Block</li><li>Left leg steps forward into  Left Front Stance: Left Middle Punch</li><li>Left leg turns into a Left Front Stance facing D: Left Middle Punch</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg turns into a Right Front Stance facing E: Right Down Block</li><li><strong>Left leg steps forward into a Left Front Stance: Left Middle Punch, kihap!</strong></li><li>Left leg turns into Left Back Stance facing C: Left Inside Forearm Block</li><li>Right leg steps forward into Right Front Stance: Right Middle Punch</li><li>Right leg turns into a Right Back Stance facing B: Right Inside Forearm Block</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li>Left leg turns into a Left Back Stance facing E: Left Inside Forearm Block</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg turns into a Right Back Stance facing D: Right Inside Forearm Block</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg steps back into a Left Front Stance: Left Middle Punch</li><li><strong>Left leg steps back into a Right Front Stance: Right Middle Punch, kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "4",
        "Name": "Dan-Gum",
        "KoreanName": "단군",
        "Image": "/images/forms/dan-gun",
        "Meaning": "Named after the holy Dan-Gun, the legendary founder of Korea in the year 2,333 BCk",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Left foot turns into a Left Back Stance facing B: Double Knife-Hand Block, Kihap!</strong></li><li>Right foot steps forward into a Right Front Stance: Right High Punch</li><li>Right leg turns into a Right Back Stance facing C: Right Double Knife-Hand Block</li><li>Left foot steps forward into a Left Front Stance: Left High Punch</li><li>Left leg turns into a Left Front Stance towards D: Left Down Block</li><li>Right leg steps forward into a Right Front Stance: Right High Punch</li><li>Left leg steps forward into a Left Front Stance: Left High Punch</li><li><strong>Right leg steps forward into a Right Front Stance: Right High Punch, kihap!</strong></li><li>Left leg turns into a Left Back Stance towards E: Left Box Block</li><li>Right leg steps forward into a Right Front Stance: Right High Punch</li><li>Right leg turns into a Right Back Stance facing F: Right Box Block</li><li>Left leg steps forward into a Left Front Stance: Left High Punch</li><li>Left leg turns into a Left Front Stance facing A:Left Down Block</li><li>Left Rising Block</li><li>Right leg steps forward into a Right Front Stance: Right Rising Block</li><li>Left leg steps forward into a Left Front Stance: Left Rising Block</li><li>Right leg steps forward into a Right Front Stance: Right Rising Block</li><li>Left leg turns into a Left Back Stance facing B: Left Reverse Knife-Hand Strike</li><li>Right leg steps forward into a Right Front Stance: Right High Punch</li><li>Right leg turns into a Right Back Stance facing C: Right Reverse Knife-Hand Strike</li><li><strong>Left leg steps forward into a Left Front Stance: Left High Punch, Kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "5",
        "Name": "Do-San",
        "KoreanName": "도산",
        "Image": "/images/forms/do-san",
        "Meaning": "Do San is the pseudonym of the patriot Ahn Chang-Ho",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Left leg turns into a Left Front Stance facing B: Left Middle Block, Kihap!</strong></li><li>Right Middle Punch</li><li>Left leg turns into a Parallel Stance facing D, Right leg turns into a Right Front Stance facing B: Right Middle Block</li><li>Left Middle Punch</li><li>Left leg steps into a Left Back Stance facing C: Left Double Knife-Hand Block</li><li><strong>Right leg steps forward into a Right Front Stance: Right Augmented Spear-Hand Strike, kihap!</strong></li><li>Pivot slightly left and rotate the palm down. Left leg turns 360° into a Left Front Stance facing D: Left Back Fist</li><li>Right leg steps forward into a Right Front Stance: Right Back Fist</li><li>Left leg turns into a Left Front Stance facing E: Left Middle Block</li><li>Right Middle Punch</li><li>Left Leg turns into a a Parallel Stance to A. Right leg turns into a Right Front Stance to F: Right Middle Block</li><li>Left Middle Punch</li><li>Left leg steps up to Right, then steps out into a Left Front Stance facing G: Wedge Block</li><li>Right Front Snap Kick into a</li><li>Right Front Stance: Right Middle Punch</li><li>Left Middle Punch</li><li>Right leg turns into a Right Front Stance facing H: Wedge Block</li><li>Left Front Snap into a</li><li>Left Front Stance: Left Middle Punch</li><li>Right Middle Punch</li><li>Left leg turns into a Left Front Stance facing A: Left Rising Block</li><li>Right leg steps forward into a Right Front Stance: Right Rising Block</li><li>Left leg turns into a Left Horse Stance towards B: Left Reverse Knife-Hand Strike</li><li><strong>Left leg steps up to Right, Right leg steps out into a Right Horse Stance towards C: Reverse Knife-Hand Strike, Kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "6",
        "Name": "Won-Hyo",
        "KoreanName": "원효",
        "Image": "/images/forms/won-hyo",
        "Meaning": "Wonhyo was the noted monk who introduced Buddhism to the Silla Dynasty in the year 686 AD",
        "Junbi": "A position",
        "Steps": "<ol><li><strong>Left leg turns into a Left Back Stance facing B: Box Block, Kihap!</strong></li><li>Right Trapping Knife-Hand Strike</li><li>Taekwondo twist into a Left Fixed Stance: Left Middle Punch</li><li>Left leg steps up to right, right leg steps out into a Right Back Stance facing C: Box Block</li><li>Left Trapping Knife-Hand Strike</li><li>Taekwondo twist into a Right Fixed Stance: Right Middle Punch</li><li>Right leg steps up to left, left leg raises into a Left Flamingo Stance facing D: Guarding Block</li><li>Left Side Thrust Kick into</li><li>Left Back Stance: Double Knife-Hand Block</li><li>Right leg steps forward into a Right Back Stance: Double Knife-Hand Block</li><li>Left leg steps forward into a Left Back Stance: Double Knife-Hand Block</li><li><strong>Right leg steps forward into a Right Front Stance: Right Augmented Spear-Hand Strike, kihap!</strong></li><li>Left leg turns into a Left Back Stance facing E: Box Block</li><li>Right Trapping Knife-Hand Strike</li><li>Taekwondo twist into a Left Fixed Stance: Left Middle Punch</li><li>Left leg steps up to right, right leg steps out into a Right Back Stance facing F: Box Block</li><li>Left Trapping Knife-Hand Strike</li><li>Taekwondo twist into a Right Fixed Stance: Right Middle Punch</li><li>Right leg steps up to left, left steps out into a Left Front Stance facing A: Right Circular Inside Forearm Block</li><li>Right Front Snap Kick into</li><li>Right Front Stance: Left Middle Punch</li><li>Left Circular Inside Forearm Block</li><li>Left Front Snap Kick into</li><li>Right Middle Punch</li><li>Right leg rises into Right Flamingo Stance: Guarding Block</li><li>Right Side Thrust Kick</li><li>Right leg steps down next to left. Left turns counterclockwise into a Left Back Stance facing B: Guarding Block</li><li><strong>Left leg steps up to right, right steps out into a Left Back Stance facing C: Guarding Block, kihap!</strong></li></ol>",
        "Paro": "Right Leg Returns"
      },
      {
        "Id": "7",
        "Name": "Yul-Gok",
        "KoreanName": "욜곡",
        "Image": "/images/forms/yul-gok",
        "Meaning": " Yul-Gok is the pseudonym of the great philosopher and scholar Yi Ee, nicknamed the “Confucius of Korea.”",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Left leg steps out into a Horse Stance on line BC: Left Arm Extension, Kihap!</strong></li><li>Right Middle Punch</li><li>Left Middle Punch</li><li>Left leg steps up to right, right steps out into a Horse Stance on line BC: Right Arm Extension</li><li>Left Middle Punch</li><li>Right Middle Punch</li><li>Right leg turns into Right Front Stance facing D: Right Inside Forearm Block</li><li>Left Front Snap Kick into</li><li>Left Front Stance: Left Middle Punch</li><li>Right Middle Punch</li><li>Left leg turns into a Left Front Stance facing E: Left Inside Forearm Block</li><li>Right Front Snap Kick into</li><li>Right Front Stance: Right Middle Punch</li><li>Left Middle Punch</li><li>Right leg turns into Right Front Stance: Right Hooking Block</li><li>Left Hooking Block, pivoting on the ball of the left foot</li><li>Right Middle Punch</li><li>Left leg steps forward into Left Front Stance: Left Hooking Block</li><li>Right Hooking Block, pivoting on the ball of the right foot</li><li>Left Middle Punch</li><li><strong>Right leg steps forward into Right Front Stance: Right Middle Punch, Kihap!</strong></li><li>Left leg raises into a Left Flamingo Stance: Guarding Block</li><li>Left Side Thrust Kick into a </li><li>Left Front Stance: Right Trapping Elbow Strike</li><li>Right leg raises into a Right Flamingo Stance toward A: Guarding Block</li><li>Right Side Thrust Kick (toward A) into a</li><li>Right Front Stance: Left Trapping Elbow Strike</li><li>Left leg turns into a Left Back Stance facing G: Open-Hand Box Block</li><li>Right leg steps forward into a Right Front Stance: Right Augmented Spear Hand Strike</li><li>Right leg turns into a Right Back Stance facing H: Open-Hand Box Block</li><li>Left leg steps forward into a Left Front Stance: Left Augmented Spear Hand Strike</li><li>Left leg turns into a Left Front Stance facing A: Left Middle Block</li><li>Right Middle Punch</li><li>Right leg steps forward into Right Front Stance: Right Middle Block</li><li>Left Middle Punch</li><li><strong>Left leg jumps forward into a Left X-Stance: Left Back Fist, kihap!</strong></li><li>Feet come together. Turn clockwise into a Right Front Stance facing C: Right Augment Block</li><li><strong>Right leg steps up to left, left steps out into Left Front Stance facing B: Left Augment Block, kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "8",
        "Name": "Joong-Gun",
        "KoreanName": "중근",
        "Image": "/images/forms/joong-gun",
        "Meaning": "Joong-Gun is named after the patriot Ahn Joong-Gun who assassinated Hirobumi Ito, the first Japanese governor-general of Korea, known as the man who played the leading part in the Korea-Japan merger.",
        "Junbi": "B position",
        "Steps": "<ol><li><strong>Left leg turns into a Left Back Stance facing B: Left Inside Ridge-Hand Block, kihap!</strong></li><li>Left Front Snap Kick</li><li>Right leg steps forward into a Right Cat Stance: Upward Palm-Heel Block</li><li>Right leg turns into a Right Back Stance facing C: Right Inside Ridge-Hand Block</li><li>Right Front Snap Kick</li><li>Left leg steps forward into a Left Cat Stance: Upward Palm-Heel Block</li><li>Left leg turns into a Left Back Stance facing D: Double Knife-Hand Block</li><li>Left leg shifts into a Left Front Stance: Right Upward Elbow Strike</li><li>Right leg steps forward into a Right Back Stance: Double Knife-Hand Block</li><li>Right leg shifts into a Right Front Stance: Left Upward Elbow Strike</li><li>Left leg steps forward into a Left Front Stance: Double Up</li><li><strong>Right leg steps forward into a Right Front Stance: Double Down, kihap!</strong></li><li>Right leg steps slightly left, left turns into a Left Front Stance facing A: Right High X Block</li><li>Left leg turns into a Left Back Stance facing E: Left Back Fist</li><li>Left leg shifts into a Left Front Stance: Left Outside Wrist Pull</li><li>Right High Punch</li><li>Left leg steps up to right, right steps out into a Right Back Stance facing F: Right Back Fist</li><li>Right leg shifts into a Right Front Stance: Right Outside Wrist Pull</li><li>Left High Punch</li><li>Right leg steps up to left, left steps out into a Left Front Stance facing A: Left Augment Block</li><li>Taekwondo twist into a Left Back Stance: Left Middle Punch</li><li>Right Side-Thrust Kick into a</li><li>Right Front Stance: Right Augment Block</li><li>Taekwondo twist into a Right Back Stance: Right Middle Punch</li><li>Left Side-Thrust Kick into a</li><li>Left Back Stance: Guarding Block</li><li>Left leg shifts into a Left Front Stance: Left Pressing Block</li><li>Right leg steps forward into a Right Back Stance: Guarding Block</li><li>Right leg shifts into a Right Front Stance: Right Pressing Block</li><li>Left leg steps up to right into a Closed Stance facing C: Right Cross-Body Punch (sanchin)</li><li>Right leg steps into a Right Back Stance facing C: Staff Block</li><li><strong>Right leg steps up to left, left steps out into a Left Back Stance facing B: Staff Block, kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "9",
        "Name": "Toi-Gye",
        "KoreanName": "퇴계",
        "Image": "/images/forms/toi-gye",
        "Meaning": "Toi-Gye is the pen name of the noted scholar Yi Hwang, and authority on Neo-Confucianism",
        "Junbi": "B position",
        "Steps": "<ol><li><strong>Left leg turns into a Left Back Stance facing B: Left Inside Forearm Block, kihap!</strong></li><li>Left leg shifts into a Left Front Stance: Right Groin Strike</li><li>Left leg steps up to right in a Closed Stance facing D: Left Down Block + Right Rear Back Fist</li><li>Right leg turns into a Right Back Stance facing C: Right Inside Forearm Block</li><li>Right leg shifts into a Right Front Stance: Left Groin Strike</li><li>Right leg steps up to left in a Closed Stance facing D: Right Down Block + Left Rear Back Fist</li><li>Left leg steps forward into a Left Front Stance facing D: Low X-Block</li><li>Double Up</li><li>Left Front Snap Kick</li><li>Left Middle Punch</li><li>Right Middle Punch</li><li>Left leg steps up to right into a Closed Stance facing E: Double Side Elbow Strike (sanchin)</li><li>Right leg stomps into a Horse Stance on line DE: W-Block</li><li>Left leg stomps into a Horse Stance on line DE: W-Block</li><li>Left leg stomps into a Horse Stance on Line EF: W-Block</li><li>Right leg stomps into a Horse Stance on line DF: W-Block</li><li>Left leg stomps into a Horse Stance on line DF: W-Block</li><li>Left leg stomps into a Horse Stance on line EF: W-Block</li><li>Right leg steps up to left, left steps forward into a Left Back Stance facing D: Left Low Augment Block</li><li>Left leg shifts into a Left Front Stance: Double Head Grab</li><li><strong>Right Grabbing Forward Knee Strike, kihap!</strong></li><li>Right foot steps down next to left, Left turns into a Left Back Stance facing A: Double Knife-Hand Block</li><li>Left Front Snap Kick</li><li>Taekwondo twist into a Left Front Stance: Left High Spear Hand Strike</li><li>Right leg steps forward into a Left Back Stance: Double Knife-Hand Block</li><li>Right Front Snap Kick</li><li>Taekwondo twist into a Right Front Stance: Right High Spear Hand Strike</li><li>Right leg steps back into a Left Back Stance: Left Down Block + Right Rear Back Fist</li><li>Jump into a Right X Stance facing A: Low X-Block</li><li>Right leg steps forward into a Right Front Stance: Right Augment Block</li><li>Left leg turns into a Left Back Stance facing B: Low Double Knife-Hand Block</li><li>Left leg shifts into a Left Front Stance facing B: Right Inside Forearm Block towards D</li><li>Left leg steps up to right, right steps out into a Right Back Stance facing C: Low Double Knife-Hand Block</li><li>Right leg shifts into a Right Front Stance facing C: Left Inside Forearm Block towards D</li><li>Shift into a Left Front Stance facing B: Right Inside Forearm Block towards D</li><li>Shift into a Right Front Stance facing C: Left Inside Forearm Block towards D</li><li><strong>Right leg steps into a Horse Stance on line BC: Right Middle Punch, kihap!</strong></li></ol>",
        "Paro": "Right Leg Returns"
      },
      {
        "Id": "10",
        "Name": "Hwa-Rang",
        "KoreanName": "화랑",
        "Image": "/images/forms/hwa-rang",
        "Meaning": "The Hwarang warriors, or 'Flowering Knights', were an elite group of male youth in Silla, an ancient Korean kingdom during the 9th and 10th centuries. ",
        "Junbi": "C position",
        "Steps": "<ol><li><strong>Left leg steps out into a Horse Stance on line BF: Left Palm Heel Block, kihap!</strong></li><li>Right Middle Punch</li><li>Left Middle Punch</li><li>Right leg slides back into a Right Back Stance facing B: Box Block</li><li>Left Grabbing Upper Cut</li><li>Taekwondo twist and slide forward into a Right Fixed Stance: Right Middle Punch</li><li>Right leg steps back into a Closed Stance facing C: Vertical Knife-Hand Strike towards A</li><li>Left leg steps forward into a Left Front Stance facing B: Left Middle Punch</li><li>Left leg turns into a Left Front Stance facing C: Left Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Left foot steps up to right into a Right Natural Stance: Left Hand Trap</li><li>Right Side-Thrust Kick (pulling hands to left side) into a Right Back Stance: Right Reverse Knife-Hand Strike</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li><strong>Right leg steps forward into a Right Front Stance: Right Middle Punch, kihap!</strong></li><li>Left leg turns into a Left Back Stance facing D: Double Knife-Hand Block</li><li>Right leg steps forward into a Right Front Stance: Augmented Spear-Hand Strike</li><li>About-face into a Left Back Stance facing E: Double Knife-Hand Block</li><li>Right Roundhouse Kick (45° Right)</li><li>Left Roundhouse Kick (45° Left) into a Left Back Stance facing E: Double Knife-Hand Block</li><li>Left leg turns into a Left Front Stance facing A: Left Down Block</li><li>Left leg shifts into a Left Back Stance: Right Cross-Body Punch</li><li>Right leg steps forward into a Right Back Stance: Left Cross-Body Punch</li><li>Left leg steps forward into a Left Back Stance: Right Cross-Body Punch</li><li>Left leg shifts into a Left Front Stance: Right Low X Block</li><li>Right leg slides forward (towards A) into a Left Back Stance facing C: Right Rear Elbow Strike towards A </li><li>Left foot steps up to right (turning counter-clockwise) into a Closed Stance facing F: Right Inside Forearm Block + Left Down Block</li><li>Left Inside Forearm Block + Right Down Block</li><li>Left foot steps forward into a Left Back Stance facing F: Double Knife-Hand Block</li><li><strong>Left foot steps up to right, right steps out into a Right Back Stance facing B: Double Knife-Hand Block, kihap!</strong></li></ol>",
        "Paro": "Right Leg Returns"
      },
      {
        "Id": "11",
        "Name": "Hikō-Ryū no Kon",
        "KoreanName": "飛行竜の棍",
        "Image": "/images/forms/hiko-ryu-no-kon",
        "Meaning": "'Hiko-Ryu' is Japanese for 'Flying Dragons' - referring to students of Royal West Martial Arts",
        "Junbi": "From Closed Bowing Position, switch bo to Closed Ready Stance",
        "Steps": "<ol><li>Left foot steps out into a Parallel Horse Stance facing forward: Parallel Rising Block</li><li>Parallel Down Block</li><li><strong>Left leg turns into a Left Forward Stance facing B: Left Forward Strike (wing), kihap!</strong></li><li>Left leg shifts into a Left Back Stance: Box Block</li><li>Right leg crosses in front of left, left steps out into a Left Forward Stance: Left Throat Spear (wing)</li><li>Right Forward Strike (wing) to the Knee</li><li>Left Forward Strike (wing) to the Ribs</li><li>R Forward Strike (wing) to the temple</li><li>About-face into a Right Forward Stance facing A: Right Throat Spear (wing)</li><li>Left leg steps forward into a Left Forward Stance: Left Throat Spear (wing)</li><h4>Theroy of the Wepon</h4><li>Right Clavical Strike (Tucking)</li><li>Left Throat Spear (wing)</li><li>Right Groin Strike</li><li>Left Throat Spear (wing)</li><li>Left Forward Strike (wing)</li><li>Right Forward Strike (wing)</li><li>Left Forward Strike (wing)</li><li><strong>Switch hands to south-paw position. Right leg turns into a Right Forward Stance facing C: Right Forward Strike (wing), kihap!</strong></li><li>Right leg shifts into a Right Back Stance: Box Block</li><li>Left leg crosses in front of right, right steps out into a Right Forward Stance: Right Throat Spear (wing)</li><li>Left Forward Strike (wing) to the knee</li><li>Right Forward Strike (wing) to the Ribs</li><li>Left Forward Strike (wing) to the temple</li><li>About-face into a Left Forward Stance facing D: Left Throat Spear (wing)</li><li>Left leg shifts into a Left Cat Stance: Left Hooking Block</li><li>Left leg steps forward into a Left Forward Stance: Left Throat Spear (wing)</li><li>Shift into a Left Aft Stance: Box Block</li><li>Right leg steps forward into a Right Walking Stance: Right Figure-8 to the Left (continuing into)</li><li>Right Figure-8 to the Right (continuing into)</li><li>Right Figure-8 to the Left. Catch the bo with your left hand (continuing into)</li><li>Left leg steps forward into a Left Walking Stance: Left Figure-8 to the right (continuing into)</li><li>Left Figure-8 to the left (continuing into)</li><li>Left figure-8 to the right. Catch the bo with your right hand. Switch left hand to south-paw</li><li>Right leg steps forward into a Right Forward Stance: Left Throat Spear (wing)</li><li><strong>Release the left hand and step forward into a Left Forward Stance, chambering the bo behind your head. Left hand grabs the butt of the bo (forming a left orthodox position): Forward Strike (wing) to the Knee, kihap!</strong></li><li>Slide the right hand into an orthodox position. Right leg rises into a Right Flamingo Stance facing E: Box Block</li><li>Slide the right hand into the middle of the bo. Release left hand. Right leg steps down into a Right Back Stance towards B: Execute 'Flight of the Dragon - Part 1' continuing into...</li><li>Left leg steps frward into a parallel closed Stance facing A: Execute 'Flight of the Dragon - Part 2' continuing into...</li><li>Right leg turns clockwise into a Right Back Stance facing E: Execute 'Flight of the Dragon - Part 3' continuing into...</li><li>'Flight of the Dragon - Part 4'</li><li>Left leg steps forward into a Left Forward Stance. Chamber the bo behind the right tricep (the left hand catches the bo under the right armpit)</li><li>Release the right hand. Rotate the bo clockwise until horizontal. Right hand catches the bo at pistol position (palm down). Change left hand to form a south-paw position: Left Throat Spear (wing)</li><li>Right foot sweep into</li><li>Right forward strike (pistol)</li><li>Left sliding front snap kick</li><li><strong>Lower left foot. Right leg steps forward into a Right Walking Stance. Left foot steps behind right into a Right X-Stance: Right Throat Spear (wing) towards E, kihap!</strong></li><li>Left leg rises into a Left Flamingo Stance facing D: Box Block</li><li>Left leg steps down into a Left Forward Stance facing A: Parallel Rising Block</li><li>Switch hands to orthodox position: Right leg steps forward into a Right Forward Stance: Right Down Block (Tucking)</li><li>Left leg steps forward into a Left Forward Stance. Bring bo above head. Switch right hand, release left hand. Rotate bo C.W. 180-degrees. Left hand catches bo (crossing in front of right arm). Continue clockwise rotation. Switching right hand, then left, forming a south-paw position. Left Down Block (tucking)</li><li>Right leg steps up to lef: chambering the bo on the right side. Left steps out into a Left Kneeling Stance: Left Throat Spear (wing)</li><li>Right foot sweep into</li><li><strong>Right forward strike (wing) to the ground, kihap!</strong></li><li>Left leg steps into a Parallel Horse Stance facing forward: Parallel Rising Block</li><li>Parallel Down Block</li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "12",
        "Name": "Nishiō",
        "KoreanName": "西王",
        "Image": "/images/forms/nishio",
        "Meaning": "Nishiō is a Japanese translation of the name Royal West, founder and Grandmaster of Royal West Martial Arts",
        "Junbi": "A position",
        "Steps": "<ol><li><strong>Right leg steps back into a Left Front Stance facing C: Left Middle Block, kihap!</strong></li><li>Left leg steps back into a Right Front Stance: Right High Palm Heel Block</li><li>Left Outside Crescent Kick</li><li>Right Roundhouse Kick</li><li>Left Turning Side-Thrust Kick into</li><li>Left Fixed Stance facing C: Left Reverse Knife-Hand Strike</li><li><strong>Right leg drops into a Left Kneeling Stance: Left Open-Hand Rising Block + Right Upper Cut, kihap!</strong></li><li>Right Grabbing Elbow Strike</li><li>Head Grab Throw to the right</li><li>About face into all fours facing B: Right Back Kick towards A</li><li>Stand up into a Left Back Stance facing B: Double Palm Heel Pushing Block</li><li>Right leg steps forward into a Right Front Stance: Left Low X Block</li><li>Left leg steps forward into a Left Front Stance: Right High X Block</li><li>Left leg steps back into a Right Front Stance: Right Middle Block</li><li>Right leg steps back into a Left Front Stance: Left High Palm Heel Strike</li><li>Right Outside Crescent Kick</li><li>Left Roundhouse Kick</li><li>Right Turning Side-Thrust Kick into</li><li>Right Fixed Stance: Right Reverse Knife-Hand Strike</li><li><strong>Left leg drops into a Right Kneeling Stance: Right Open-Hand Rising Block + Left Upper Cut, kihap!</strong></li><li>Left Grabbing Elbow Strike</li><li>Head Grab Throw to the left</li><li>About face onto all fours facing C: Left Back Kick Towards B</li><li>Stand up into a Right Back Stance facing C: Double Palm Heel Pushing Block</li><li>Left leg steps forward into a Left Front Stance: Right Low X Block</li><li>Right leg steps forward into a Right Front Stance: Left High X Block</li><li>Left Inside Twist Kick into</li><li>Left Front Stance: Left High Punch</li><li><strong>Right Middle Punch, kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "13",
        "Name": "Won-Hyo",
        "KoreanName": "원효",
        "Image": "/images/forms/won-hyo",
        "Meaning": "Wonhyo was the noted monk who introduced Buddhism to the Silla Dynasty in the year 686 AD",
        "Junbi": "A position",
        "Steps": "",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "14",
        "Name": "Won-Hyo",
        "KoreanName": "원효",
        "Image": "/images/forms/won-hyo",
        "Meaning": "Wonhyo was the noted monk who introduced Buddhism to the Silla Dynasty in the year 686 AD",
        "Junbi": "A position",
        "Steps": "",
        "Paro": "Left Leg Returns"
      },
      {
        "Id": "3",
        "Name": "Saju Jirugi",
        "KoreanName": "사주 찌르기",
        "Image": "/images/forms/saju-jirugi",
        "Meaning": "Four-Direction Punch",
        "Junbi": "Parallel Ready Stance",
        "Steps": "<ol><li><strong>Right leg steps forward into a Right Front Stance: Right Middle Punch, Kihap!</strong></li><li>Right leg shifts into a Left Front Stance facing C: Left Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg shifts into a Left Front Stance facing D: Left Down Block</li><li>Right leg steps forward into a Right Front Stance: Right Middle Punch</li><li>Right leg shifts into a Left Front Stance facing E: Left Down Block</li><li><strong> Right leg steps forward into a Right Front Stance: Right Middle Punch, Kihap!</strong></li><li>Right leg returns to Parallel Ready Stance facing B.</li><li><strong>Left leg steps forward into a Left Front Stance: Left Middle Punch, Kihap!</strong></li><li>Left leg shifts into a Right Front Stance facing E: Right Down Block</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li>Left leg shifts into a Right Front Stance facing D: Right Down Block</li><li>Left leg steps forward into a Left Front Stance: Left Middle Punch</li><li>Left shifts into a Right Front Stance facing C: Right Down Block</li><li><strong>Left leg steps forward into a Left Front Stance: Left Middle Punch, Kihap!</strong></li></ol>",
        "Paro": "Left Leg Returns"
      }
]